Documents/ОтметкаВыполненияМедосмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОтметкаВыполненияМедосмотра</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрохождениеМедОсмотра</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПрохождениеМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияМедосмотра</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияМедосмотра</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПриема</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ПараметрыHTML</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтметкаВыполненияМедосмотра/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Тогда
		МедосмотрыСервер.ОчиститьОтметкиВыполненияДействияМедосмотра(Ссылка);
	Иначе
		ТаблицаОтметок = Новый ТаблицаЗначений;
		ТаблицаОтметок.Колонки.Добавить("Действие");
		ТаблицаОтметок.Колонки.Добавить("Выполнено");
		ТаблицаОтметок.Колонки.Добавить("Изменено");
		Для Каждого СтрокаДействие Из ДействияМедосмотра Цикл
			ТаблицаОтметок.Добавить().Действие = СтрокаДействие.Действие;
		КонецЦикла;
		ТаблицаОтметок.ЗаполнитьЗначения(Истина, "Выполнено, Изменено");
		
		МедосмотрыСервер.ЗаписатьОтметкиВыполненияДействияМедосмотра(Ссылка, ПрохождениеМедОсмотра, ТаблицаОтметок, Дата);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
